fhorinek/BB/BB3_loader/BB3_loader.ioc
#MicroXplorer Configuration settings - do not modify
PA11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
Dma.UART4_RX.2.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
SH.FMC_D7_DA7.0=FMC_D7,16b-d1
PCC.Series=STM32H7
PD12.GPIO_Label=DISP_RST
SH.FMC_D0_DA0.ConfNb=1
PH0-OSC_IN.Signal=RCC_OSC_IN
SH.FMC_D6_DA6.ConfNb=1
SH.FMC_D9_DA9.ConfNb=1
FATFS._USE_LFN=1
PB10.Mode=I2C
VP_FATFS_VS_SDIO.Mode=SDIO
SH.GPXTI9.0=GPIO_EXTI9
RCC.PLL2_VCI_Range-AdvancedSettings=RCC_PLL2VCIRANGE_0
NVIC.DMA1_Stream2_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PC12.Signal=SDMMC1_CK
RCC.PLLFRACN=0
PD3.GPIOParameters=GPIO_Label
PC6.GPIO_Label=NG_CDP_CLM_2
RCC.RTCFreq_Value=32768
PA3.GPIOParameters=GPIO_Label
RCC.CpuClockFreq_Value=280000000
SH.FMC_D5_DA5.0=FMC_D5,16b-d1
PD6.GPIO_Label=BT1
PA2.GPIOParameters=GPIO_Label
SH.FMC_NOE.ConfNb=1
PinOutPanel.RotationAngle=-90
SH.FMC_NWE.0=FMC_NWE,Lcd1
PE6.GPIO_Label=LED_TORCH
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.AHB4Freq_Value=280000000
SH.FMC_D9_DA9.0=FMC_D9,16b-d1
Dma.MEMTOMEM.0.SyncSignalID=NONE
RCC.LPTIM1Freq_Value=140000000
SH.GPXTI7.ConfNb=1
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.Priority=MDMA_PRIORITY_LOW
RCC.SAI2BFreq_Value=56000000
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.SDMMC1_IRQn=true\:5\:0\:true\:false\:true\:true\:true
PCC.Seq0.Step1.Oscillator=HSI Flash-ON
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.SourceDataSize=MDMA_SRC_DATASIZE_BYTE
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_ENABLE
NVIC.EXTI1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
USB_DEVICE.PRODUCT_STRING_MSC_HS=Strato
SH.GPXTI3.ConfNb=1
PCC.PartNumber=STM32H7A3VITx
VP_FATFS_VS_SDIO.Signal=FATFS_VS_SDIO
SH.FMC_D11_DA11.0=FMC_D11,16b-d1
RCC.I2C4Freq_Value=140000000
Dma.UART4_RX.2.SyncEnable=DISABLE
TIM2.IPParameters=Channel-PWM Generation4 CH4,Prescaler,Period,ClockDivision
PD4.Signal=FMC_NOE
I2C2.I2C_Speed_Mode=I2C_Fast
SH.FMC_D10_DA10.ConfNb=1
PC7.Signal=FMC_NE1
PCC.Seq0.Step1.TaMax=124.96
RCC.DIVQ3Freq_Value=48000000
PD0.Signal=FMC_D2_DA2
Dma.MEMTOMEM.0.EventEnable=DISABLE
PD8.Signal=FMC_D13_DA13
PE5.Signal=GPIO_Input
PCC.Seq0.Step1.Category=In DS Table
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.DestBlockAddressOffset=0
Dma.MEMTOMEM.0.RequestNumber=1
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PCC.Seq0.Step1.Vdd=3.0
PB3.Mode=Trace_Asynchronous_SW
PCC.Seq0.Step0.Voltage_Source=Battery
RCC.DIVM3=2
RCC.DIVM2=1
RCC.DIVM1=1
RCC.RTCClockSelection=RCC_RTCCLKSOURCE_LSE
SH.GPXTI7.0=GPIO_EXTI7
RCC.DFSDM2Freq_Value=140000000
TIM15.Period=100
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.9.0
MxDb.Version=DB.6.0.21
Dma.MEMTOMEM.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
ProjectManager.BackupPrevious=false
FMC.DataSetupTime1=12
RCC.FMCFreq_Value=280000000
PC4.GPIO_Label=VCC_MAIN_EN
TIM15.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
PE9.Signal=FMC_D6_DA6
RCC.DFSDM2ACLkFreq_Value=140000000
Dma.MEMTOMEM.0.Instance=DMA1_Stream0
SH.FMC_D15_DA15.ConfNb=1
NVIC.TIM2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.USART16Freq_Value=140000000
PA0.Mode=Asynchronous
PE4.GPIO_Label=USB_DATA_DFP_3A
Dma.UART7_TX.1.PeriphInc=DMA_PINC_DISABLE
PC9.Mode=SD_4_bits_Wide_bus
Dma.MEMTOMEM.0.SyncEnable=DISABLE
FATFS._USE_MKFS=1
PA8.Signal=UART7_RX
SH.FMC_D1_DA1.0=FMC_D1,16b-d1
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
USB_OTG_HS.IPParameters=VirtualMode,dma_enable,use_dedicated_ep1,lpm_enable,VirtualMode-Device_Only_FS
Dma.UART4_RX.2.Direction=DMA_PERIPH_TO_MEMORY
RCC.DIVR2Freq_Value=40000000
USB_DEVICE.MSC_MEDIA_PACKET-MSC_HS=32768
PE10.Signal=FMC_D7_DA7
ProjectManager.HalAssertFull=false
RCC.DIVP2Freq_Value=100000000
Mdma.RequestSet0=MDMA_Channel2
PA0.Signal=UART4_TX
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.DstAddress=0
RCC.MCO2PinFreq_Value=280000000
USB_DEVICE.USBD_SELF_POWERED-MSC_HS=1
Mcu.Package=LQFP100
PB9.Signal=GPIO_Input
TIM2.Prescaler=200
NVIC.TimeBase=TIM1_UP_IRQn
RCC.PLL3FRACN=0
PD6.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
PD12.Signal=GPIO_Output
USB_DEVICE.VirtualMode-MSC_HS=Msc
Dma.MEMTOMEM.0.PeriphInc=DMA_PINC_ENABLE
PCC.Seq0.Step1.Average_Current=263.82 \u00B5A
NVIC.TimeBaseIP=TIM1
PA10.Signal=GPIO_Output
RCC.DFSDMFreq_Value=140000000
PC11.Mode=SD_4_bits_Wide_bus
Dma.UART7_TX.1.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
PCC.Seq0.Step1.DMIPS=0.0
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.DataAlignment=MDMA_DATAALIGN_PACKENABLE
RCC.TraceFreq_Value=280000000
RCC.APB4Freq_Value=140000000
RCC.CECFreq_Value=32000
PCC.Seq0.Step1.SubMode2=NA
PCC.Seq0.Step1.SubMode1=DSTOP
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.LPUART1Freq_Value=140000000
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.RequestParameters=Instance,CircularMode,TransferTriggerMode,Priority,Endianness,SourceInc,DestinationInc,SourceDataSize,DestDataSize,DataAlignment,BufferTransferLength,SourceBurst,DestBurst,SourceBlockAddressOffset,DestBlockAddressOffset,MaskAddress,MaskData,SrcAddress,DstAddress,BlockDataLength,BlockCount,Rank
PE6.Locked=true
SH.S_TIM2_CH4.ConfNb=1
PCC.Seq0.Step1.SubMode3=SRDSTOP
NVIC.TIM15_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PD15.Signal=FMC_D1_DA1
SH.FMC_D3_DA3.0=FMC_D3,16b-d1
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
RCC.SupplySource=PWR_LDO_SUPPLY
RCC.VCO3OutputFreq_Value=192000000
SH.FMC_D3_DA3.ConfNb=1
RCC.VDD_VALUE=3
PCC.Seq0.Step0.Category=Measurements
PD6.GPIOParameters=GPIO_Label,GPIO_ModeDefaultEXTI
ProjectManager.ProjectFileName=BB3_loader.ioc
RCC.DIVQ3=4
RCC.DIVQ1=10
Mcu.PinsNb=67
PA15.GPIOParameters=GPIO_Label
Dma.MEMTOMEM.0.Priority=DMA_PRIORITY_LOW
Dma.UART7_TX.1.Mode=DMA_NORMAL
PC13.Locked=true
Dma.MEMTOMEM.0.SyncRequestNumber=1
PA9.GPIO_Label=USB_VBUS
SH.FMC_D10_DA10.0=FMC_D10,16b-d1
PC13.Signal=GPIO_Output
RCC.SWPMI1Freq_Value=140000000
PD3.Signal=GPIO_Output
RCC.DIVP3=4
PC6.Signal=GPIO_Output
PD7.Signal=GPXTI7
PD1.Signal=FMC_D3_DA3
PCC.Line=STM32H7A3/7B3
PC0.Signal=GPIO_Output
PC14-OSC32_IN.Signal=RCC_OSC32_IN
SH.FMC_NOE.0=FMC_NOE,Lcd1
RCC.QSPIFreq_Value=40000000
SH.FMC_A16_CLE.ConfNb=1
Mcu.Pin62=VP_CRC_VS_CRC
USB_OTG_HS.VirtualMode-Device_Only_FS=Device_Only_FS
Mcu.Pin63=VP_FATFS_VS_SDIO
VP_USB_DEVICE_VS_USB_DEVICE_MSC_HS.Mode=MSC_HS
Mcu.Pin60=PB5
Mcu.Pin61=PB9
Mcu.Pin66=VP_USB_DEVICE_VS_USB_DEVICE_MSC_HS
Dma.UART4_RX.2.PeriphInc=DMA_PINC_DISABLE
Mcu.Pin64=VP_RNG_VS_RNG
CRC.IPParameters=OutputDataInversionMode,InputDataInversionMode
Mcu.Pin65=VP_SYS_VS_tim1
Dma.UART7_TX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
PD10.Signal=FMC_D15_DA15
SH.GPXTI6.ConfNb=1
FMC.AddressSetupTime1=6
RCC.USART234578Freq_Value=140000000
PCC.MCU=STM32H7A3V(G-I)Tx
PA15.Locked=true
RCC.Tim1OutputFreq_Value=280000000
Mcu.Pin59=PB4
RCC.CDPPRE1=RCC_APB1_DIV2
Mcu.Pin57=PD7
RCC.CDPPRE2=RCC_APB2_DIV2
RCC.SPI123Freq_Value=56000000
Mcu.Pin58=PB3
PB11.Mode=I2C
CRC.InputDataInversionMode=CRC_INPUTDATA_INVERSION_BYTE
Mcu.Pin51=PD1
SH.FMC_D15_DA15.0=FMC_D15,16b-d1
Mcu.Pin52=PD2
USB_OTG_HS.lpm_enable=DISABLE
Mcu.Pin50=PD0
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
Mcu.Pin55=PD5
Mcu.Pin56=PD6
Mcu.Pin53=PD3
Mcu.Pin54=PD4
PC6.Locked=true
PA9.Signal=GPXTI9
VP_USB_DEVICE_VS_USB_DEVICE_MSC_HS.Signal=USB_DEVICE_VS_USB_DEVICE_MSC_HS
RCC.DIVN3=48
RCC.DIVN2=25
RCC.DIVN1=70
PB5.Locked=true
PB9.Locked=true
UART4.FIFOMode=FIFOMODE_DISABLE
PD7.Locked=true
Mcu.Pin48=PC11
Mcu.Pin49=PC12
Mcu.Pin46=PA15
Mcu.Pin47=PC10
PB10.Signal=I2C2_SCL
Dma.MEMTOMEM.0.MemBurst=DMA_MBURST_SINGLE
PC6.PinState=GPIO_PIN_SET
Dma.UART7_TX.1.SyncEnable=DISABLE
RCC.USBCLockSelection=RCC_USBCLKSOURCE_HSI48
Mcu.Pin40=PA9
Mcu.Pin41=PA10
Mcu.Pin44=PA13
PC12.Mode=SD_4_bits_Wide_bus
Mcu.Pin45=PA14
Dma.UART4_RX.2.Mode=DMA_CIRCULAR
Mcu.Pin42=PA11
Mcu.Pin43=PA12
ProjectManager.LastFirmware=true
SH.S_TIM15_CH2.ConfNb=1
RCC.AHB12Freq_Value=280000000
PA1.Mode=Asynchronous
PE14.Signal=FMC_D11_DA11
Dma.UART7_TX.1.FIFOMode=DMA_FIFOMODE_DISABLE
PE15.Signal=FMC_D12_DA12
RCC.RNGCLockSelection=RCC_RNGCLKSOURCE_PLL
PCC.Seq0.Step0.Vcore=VOS0
Mcu.Pin37=PC8
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.DestinationInc=MDMA_DEST_INC_BYTE
Mcu.Pin38=PC9
Mcu.Pin35=PC6
PE8.Signal=FMC_D5_DA5
Mcu.Pin36=PC7
VP_SYS_VS_tim1.Signal=SYS_VS_tim1
PCC.Seq0.Step0.SubMode3=SRDRUN
SH.FMC_D14_DA14.ConfNb=1
PCC.Seq0.Step0.SubMode2=NA
Mcu.Pin39=PA8
RCC.RNGFreq_Value=56000000
USB_DEVICE.USBD_DEBUG_LEVEL-MSC_HS=0
Mcu.Pin30=PD10
PCC.Seq0.Step0.SubMode1=DRUN
Mcu.Pin33=PD14
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_FULL_ACCESS
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.MaskAddress=0
Mcu.Pin34=PD15
Mcu.Pin31=PD11
Mcu.Pin32=PD12
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.BlockCount=0
RCC.CDPPRE=RCC_APB3_DIV2
TIM2.Period=100
PA13.Mode=Trace_Asynchronous_SW
ProjectManager.FreePins=true
CRC.OutputDataInversionMode=CRC_OUTPUTDATA_INVERSION_ENABLE
RCC.LPTIM2Freq_Value=140000000
Mcu.Pin26=PB10
Mcu.Pin27=PB11
Mcu.Pin24=PE14
ProjectManager.UnderRoot=true
Mcu.Pin25=PE15
CORTEX_M7.IPParameters=MPU_Control,Enable-Cortex_Memory_Protection_Unit_Region0_Settings,Size-Cortex_Memory_Protection_Unit_Region0_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings,CPU_DCache
Mcu.Pin28=PD8
Mcu.Pin29=PD9
PC8.Mode=SD_4_bits_Wide_bus
SH.FMC_D7_DA7.ConfNb=1
Mcu.Pin22=PE12
PB5.Signal=GPIO_Input
Mcu.Pin23=PE13
Mcu.Pin20=PE10
PA3.Locked=true
Mcu.Pin21=PE11
PA10.Locked=true
NVIC.ForceEnableDMAVector=false
PD11.Signal=FMC_A16_CLE
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PE5.GPIO_Label=USB_DATA_DFP_1A
ProjectManager.CompilerOptimize=6
PA11.Signal=USB_OTG_HS_DM
ProjectManager.HeapSize=0x400
Mcu.Pin15=PC4
Dma.UART7_TX.1.MemInc=DMA_MINC_ENABLE
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PC5
Mcu.Pin13=PA2
UART7.IPParameters=BaudRate
Mcu.Pin14=PA3
Mcu.Pin19=PE9
RCC.LPTIM345Freq_Value=140000000
UART7.BaudRate=921600
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PE7
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.Rank=First
Mcu.Pin18=PE8
RCC.LTDCFreq_Value=48000000
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.SrcAddress=0
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA0
Mcu.Pin12=PA1
Mcu.Pin10=PC1
PC1.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
PE3.Signal=GPXTI3
Dma.MEMTOMEM.0.Direction=DMA_MEMORY_TO_MEMORY
PA8.Mode=Asynchronous
PCC.Seq0.Step1.Vcore=SVOS5
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.Instance=MDMA_Channel2
PCC.Seq0.Step1.Voltage_Source=Battery
SH.GPXTI1.ConfNb=1
SH.FMC_D12_DA12.ConfNb=1
PD2.Signal=SDMMC1_CMD
RCC.HCLK3ClockFreq_Value=280000000
PCC.Seq0=2
RCC.DIVR3=4
RCC.DIVR2=5
RCC.SAI2AFreq_Value=56000000
PC0.Locked=true
PC1.Signal=GPXTI1
PD7.GPIOParameters=GPIO_Label,GPIO_ModeDefaultEXTI
Dma.MEMTOMEM.0.SignalID=NONE
Mcu.Family=STM32H7
FMC.IPParameters=AddressSetupTime1,DataSetupTime1,BusTurnAroundDuration1,BankMapConfig
RCC.DIVQ2Freq_Value=100000000
SH.GPXTI1.0=GPIO_EXTI1
NVIC.OTG_HS_IRQn=true\:6\:0\:true\:false\:true\:false\:true
ProjectManager.MainLocation=Core/Src
I2C2.IPParameters=Timing,I2C_Speed_Mode
RCC.CDCPREFreq_Value=280000000
RCC.SAI1Freq_Value=56000000
RCC.CortexFreq_Value=280000000
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.DestBurst=MDMA_DEST_BURST_SINGLE
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.BlockDataLength=0
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32H7A3VITx
SH.FMC_D14_DA14.0=FMC_D14,16b-d1
PCC.Seq0.Step0.CPU_Frequency=280 MHz
Dma.UART7_TX.1.SyncRequestNumber=1
PCC.Seq0.Step0.User's_Consumption=0 mA
PC10.Signal=SDMMC1_D2
PC5.Locked=true
I2C2.Timing=0x00D04BFF
TIM15.ClockDivision=TIM_CLOCKDIVISION_DIV4
PA12.GPIOParameters=GPIO_Speed
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-MX_MDMA_Init-MDMA-false-HAL-true,4-SystemClock_Config-RCC-false-HAL-false,5-MX_UART7_Init-UART7-false-HAL-true,6-MX_FMC_Init-FMC-false-HAL-true,7-MX_SDMMC1_SD_Init-SDMMC1-false-HAL-true,8-MX_TIM2_Init-TIM2-false-HAL-true,9-MX_FATFS_Init-FATFS-false-HAL-false,10-MX_USB_DEVICE_Init-USB_DEVICE-true-HAL-false,11-MX_CRC_Init-CRC-false-HAL-true,12-MX_I2C2_Init-I2C2-false-HAL-true,13-MX_TIM15_Init-TIM15-false-HAL-true,14-MX_UART4_Init-UART4-false-HAL-true,15-MX_RNG_Init-RNG-false-HAL-true,16-MX_IWDG1_Init-IWDG1-false-HAL-true,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
PC0.GPIOParameters=GPIO_Label
PA9.GPIOParameters=GPIO_Label,GPIO_ModeDefaultEXTI
PA11.GPIOParameters=GPIO_Speed
NVIC.EXTI3_IRQn=true\:0\:0\:false\:false\:true\:true\:true
SH.FMC_D6_DA6.0=FMC_D6,16b-d1
PC0.GPIO_Label=BQ_OTG
PA11.Mode=Device_Only_FS
SDMMC1.ClockDiv=0
PD6.Locked=true
RCC.PLL1_VCO_SEL-AdvancedSettings=RCC_PLL1VCOMEDIUM
NVIC.TIM1_UP_IRQn=true\:0\:0\:true\:false\:true\:false\:true
RCC.PLL2FRACN=0
RCC.VCO2OutputFreq_Value=200000000
PCC.Seq0.Step1.Duration=0.9 ms
PC13.GPIO_Label=ALT_CH_EN
PC1.Locked=true
PB11.Signal=I2C2_SDA
Dma.UART7_TX.1.Instance=DMA1_Stream1
PE5.GPIOParameters=GPIO_Label
ProjectManager.StackSize=0x800
PB5.GPIOParameters=GPIO_Label
SH.S_TIM15_CH2.0=TIM15_CH2,PWM Generation2 CH2
RCC.VCOInput3Freq_Value=4000000
Mdma.MDMA_Channel2.RequestsNb=1
Mcu.IP4=FATFS
Mcu.IP5=FMC
Mcu.IP2=DEBUG
Mcu.IP3=DMA
PA15.GPIO_Label=NG_CDP_CLM_1
Mcu.IP0=CORTEX_M7
Mcu.IP1=CRC
PA12.Signal=USB_OTG_HS_DP
PE4.GPIOParameters=GPIO_Label
USB_OTG_HS.use_dedicated_ep1=DISABLE
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.SourceBlockAddressOffset=0
Mcu.UserConstants=disp_timer,(&htim2);esp_uart,(&huart4);debug_uart,(&huart7);fanet_uart,(&huart8);gnss_uart,(&huart5);tft_dma,(&hdma_memtomem_dma1_stream0);led_timer,(&htim15);led_bclk,TIM_CHANNEL_4;led_torch,TIM_CHANNEL_2;mems_i2c,(&hi2c1);sys_i2c,(&hi2c2);meas_timer,(&htim3);esp_spi,(&hspi1);rtos_timer,(&htim17)
PC1.GPIOParameters=GPIO_Label,GPIO_ModeDefaultEXTI
RCC.DIVP3Freq_Value=48000000
RCC.SDMMCFreq_Value=40000000
TIM15.Prescaler=200
Mcu.ThirdPartyNb=0
FMC.BankMapConfig=FMC_SWAPBMAP_SDRAM_SRAM
RCC.HCLKFreq_Value=280000000
Mcu.IPNb=19
Dma.UART7_TX.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
ProjectManager.PreviousToolchain=STM32CubeIDE
SH.FMC_NWE.ConfNb=1
Dma.UART7_TX.1.SyncSignalID=NONE
RCC.SPDIFRXFreq_Value=56000000
Dma.UART4_RX.2.RequestNumber=1
Dma.UART4_RX.2.MemDataAlignment=DMA_MDATAALIGN_BYTE
TIM2.ClockDivision=TIM_CLOCKDIVISION_DIV4
Mcu.Pin6=PC15-OSC32_OUT
Mcu.Pin7=PH0-OSC_IN
Mcu.Pin8=PH1-OSC_OUT
Mcu.Pin9=PC0
PH0-OSC_IN.Mode=HSE-External-Oscillator
Mcu.Pin0=PE3
Mcu.Pin1=PE4
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PE5
Mcu.Pin3=PE6
Mcu.Pin4=PC13
Mcu.Pin5=PC14-OSC32_IN
RCC.DIVR3Freq_Value=48000000
RCC.HSE_VALUE=8000000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.FMC_D8_DA8.0=FMC_D8,16b-d1
Mcu.IP10=RNG
PCC.Seq0.Step0.DMIPS=599.2
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP12=SYS
Mcu.IP11=SDMMC1
SDMMC1.ClockEdge=SDMMC_CLOCK_EDGE_RISING
SH.FMC_D2_DA2.0=FMC_D2,16b-d1
Mcu.IP18=USB_OTG_HS
Mcu.IP17=USB_DEVICE
Dma.UART4_RX.2.EventEnable=DISABLE
RCC.DIVP1Freq_Value=280000000
Mcu.IP14=TIM15
PB4.Mode=Asynchronous
FMC.BusTurnAroundDuration1=0
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.MaskData=0
Mcu.IP13=TIM2
PE13.Signal=FMC_D10_DA10
RCC.PLL1_VCI_Range-AdvancedSettings=RCC_PLL1VCIRANGE_0
Mcu.IP16=UART7
Mcu.IP15=UART4
PC14-OSC32_IN.Mode=LSE-External-Oscillator
PA14.Mode=Trace_Asynchronous_SW
VP_SYS_VS_tim1.Mode=TIM1
File.Version=6
PA10.GPIO_Label=ESP_EN
PE3.GPIOParameters=GPIO_Label,GPIO_ModeDefaultEXTI
SH.FMC_D5_DA5.ConfNb=1
PE3.Locked=true
SH.FMC_D2_DA2.ConfNb=1
USB_OTG_HS.dma_enable=DISABLE
PE4.Signal=GPIO_Input
PE6.GPIOParameters=GPIO_Label
Dma.RequestsNb=3
Dma.UART4_RX.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
ProjectManager.ProjectName=BB3_loader
FATFS._USE_LABEL=1
PD7.GPIO_Label=BT4
Dma.UART4_RX.2.Instance=DMA1_Stream2
RCC.APB3Freq_Value=140000000
PH1-OSC_OUT.Mode=HSE-External-Oscillator
PCC.Seq0.Step0.Oscillator=HSE PLL
SH.FMC_D0_DA0.0=FMC_D0,16b-d1
RCC.SDMMC1CLockSelection=RCC_SDMMCCLKSOURCE_PLL2
SH.FMC_D4_DA4.ConfNb=1
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=ESP_BOOT
SH.GPXTI5.ConfNb=1
PA15.Signal=GPIO_Output
Dma.MEMTOMEM.0.FIFOThreshold=DMA_FIFO_THRESHOLD_FULL
Dma.UART4_RX.2.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
USB_DEVICE.CLASS_NAME_HS=MSC
SH.FMC_D4_DA4.0=FMC_D4,16b-d1
RCC.DIVR1Freq_Value=280000000
PCC.Checker=false
PCC.Seq0.Step0.Duration=0.1 ms
USB_DEVICE.VirtualModeHS=Msc_HS
Dma.UART4_RX.2.FIFOMode=DMA_FIFOMODE_DISABLE
PB5.GPIO_Label=BT2
Dma.Request2=UART4_RX
Dma.Request1=UART7_TX
PC4.Locked=true
NVIC.DMA1_Stream0_IRQn=true\:5\:0\:true\:false\:true\:true\:true
PCC.Seq0.Step0.Peripherals=DMA1 DMA2 DMA2D FMC I2C1 I2C2 JPEG OCTOSPI1 SDMMC1 SPI1 TIM2 TIM3 UART4 UART5 USB_OTG_HS GPIOA GPIOB GPIOC GPIOD GPIOE GPIOH
PC5.Signal=GPXTI5
PD3.GPIO_Label=FANET_SW
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.Endianness=MDMA_LITTLE_ENDIANNESS_PRESERVE
PE7.Signal=FMC_D4_DA4
PD6.Signal=GPXTI6
Dma.UART7_TX.1.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.Request0=MEMTOMEM
PCC.Seq0.Step1.Mode=STOP
RCC.SRDPPRE=RCC_APB4_DIV2
PA12.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
RCC.Tim2OutputFreq_Value=280000000
RCC.DFSDMACLkFreq_Value=56000000
PB4.Signal=UART7_TX
PA3.Signal=S_TIM2_CH4
PCC.Seq0.Step1.CPU_Frequency=64 MHz
PCC.Seq0.Step1.Memory=NA
PA2.Locked=true
PE3.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
SH.GPXTI5.0=GPIO_EXTI5
Dma.MEMTOMEM.0.MemDataAlignment=DMA_MDATAALIGN_WORD
TIM2.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
Dma.UART7_TX.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.UART7_TX.1.RequestNumber=1
UART4.IPParameters=FIFOMode
PB9.GPIO_Label=BT5
Dma.UART7_TX.1.Direction=DMA_MEMORY_TO_PERIPH
PCC.Seq0.Step0.Average_Current=86.61 mA
PCC.Vdd=3.0
ProjectManager.NoMain=false
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.BufferTransferLength=1
PC11.Signal=SDMMC1_D3
PC8.Signal=SDMMC1_D0
PC4.Signal=GPIO_Output
