fhorinek/BB/BB3_loader/BB3_loader.ioc
PC10.Mode=SD_4_bits_Wide_bus
Dma.UART4_RX.2.Priority=DMA_PRIORITY_LOW
ProjectManager.DefaultFWLocation=true
PD9.Signal=FMC_D14_DA14
PD5.Signal=FMC_NWE
NVIC.DMA1_Stream1_IRQn=true\:2\:0\:true\:false\:true\:false\:true
ProjectManager.DeletePrevious=true
SDMMC1.ClockPowerSave=SDMMC_CLOCK_POWER_SAVE_DISABLE
VP_RNG_VS_RNG.Mode=RNG_Activate
USB_DEVICE.IPParameters=VirtualModeHS,CLASS_NAME_HS,VirtualMode-MSC_HS,PRODUCT_STRING_MSC_HS,MANUFACTURER_STRING-MSC_HS,USBD_DEBUG_LEVEL-MSC_HS,USBD_SELF_POWERED-MSC_HS,MSC_MEDIA_PACKET-MSC_HS
Dma.UART4_RX.2.MemInc=DMA_MINC_ENABLE
RCC.FamilyName=M
PB9.GPIOParameters=GPIO_Label
PD12.Locked=true
Dma.UART4_RX.2.SignalID=NONE
RCC.SPI6Freq_Value=140000000
SH.GPXTI6.0=GPIO_EXTI6
FATFS.IPParameters=USE_DMA_CODE_SD,_USE_MKFS,_USE_LABEL,_USE_LFN
PA13.Signal=DEBUG_JTMS-SWDIO
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.DestDataSize=MDMA_DEST_DATASIZE_BYTE
CORTEX_M7.MPU_Control=__NULL
PCC.Seq0.Step0.TaMax=115.65
RCC.SPI45Freq_Value=140000000
Dma.UART4_RX.2.SyncRequestNumber=1
PD12.GPIOParameters=GPIO_Label
ProjectManager.TargetToolchain=STM32CubeIDE
RCC.VCO1OutputFreq_Value=560000000
PCC.Seq0.Step1.User's_Consumption=0 mA
SH.FMC_D13_DA13.0=FMC_D13,16b-d1
SH.FMC_A16_CLE.0=FMC_A16,A16_1
SH.FMC_D1_DA1.ConfNb=1
PCC.Seq0.Step0.Mode=RUN
VP_RNG_VS_RNG.Signal=RNG_VS_RNG
PC5.GPIOParameters=GPIO_Label
RCC.AXIClockFreq_Value=280000000
PE4.Locked=true
SDMMC1.HardwareFlowControl=SDMMC_HARDWARE_FLOW_CONTROL_DISABLE
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=48000000
Dma.MEMTOMEM.0.FIFOMode=DMA_FIFOMODE_ENABLE
PE11.Signal=FMC_D8_DA8
TIM15.IPParameters=Channel-PWM Generation2 CH2,Prescaler,Period,ClockDivision
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PD3.Locked=true
PA1.Signal=UART4_RX
RCC.CKPERFreq_Value=64000000
Dma.UART4_RX.2.SyncSignalID=NONE
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.CircularMode=MDMA_LINEAR_LIST
PD2.Mode=SD_4_bits_Wide_bus
Dma.UART7_TX.1.EventEnable=DISABLE
board=custom
PCC.Temperature=25
Dma.UART7_TX.1.Priority=DMA_PRIORITY_MEDIUM
SH.GPXTI3.0=GPIO_EXTI3
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.SourceBurst=MDMA_SOURCE_BURST_SINGLE
RCC.VCOInput1Freq_Value=8000000
FATFS.USE_DMA_CODE_SD=1
RCC.APB2Freq_Value=140000000
PCC.Seq0.Step0.Frequency=16 MHz
MxCube.Version=6.2.1
SH.FMC_D13_DA13.ConfNb=1
PC13.GPIOParameters=GPIO_Label
RCC.FDCANFreq_Value=56000000
Dma.UART7_TX.1.SignalID=NONE
Dma.MEMTOMEM.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
RCC.ADCFreq_Value=100000000
PC1.GPIO_Label=BQ_INT
PA10.GPIOParameters=GPIO_Label
SH.FMC_D12_DA12.0=FMC_D12,16b-d1
PH1-OSC_OUT.Signal=RCC_OSC_OUT
PE5.Locked=true
PE6.Signal=S_TIM15_CH2
SH.FMC_D11_DA11.ConfNb=1
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CDCPREFreq_Value,CDPPRE,CDPPRE1,CDPPRE2,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,DFSDM2ACLkFreq_Value,DFSDM2Freq_Value,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVM3,DIVN1,DIVN2,DIVN3,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2,DIVR2Freq_Value,DIVR3,DIVR3Freq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL1_VCI_Range-AdvancedSettings,PLL1_VCO_SEL-AdvancedSettings,PLL2FRACN,PLL2_VCI_Range-AdvancedSettings,PLL3FRACN,PLLFRACN,PLLSourceVirtual,QSPICLockSelection,QSPIFreq_Value,RNGCLockSelection,RNGFreq_Value,RTCClockSelection,RTCFreq_Value,SAI1Freq_Value,SAI2AFreq_Value,SAI2BFreq_Value,SDMMC1CLockSelection,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SRDPPRE,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,SupplySource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBCLockSelection,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value,VDD_VALUE
PD7.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
ProjectManager.AskForMigrate=true
Mcu.Name=STM32H7A3V(G-I)Tx
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_SIZE_4GB
PE12.Signal=FMC_D9_DA9
PA2.Signal=GPIO_Input
Mcu.IP8=NVIC
Mcu.IP9=RCC
PD14.Signal=FMC_D0_DA0
Dma.MEMTOMEM.0.PeriphDataAlignment=DMA_PDATAALIGN_WORD
Mcu.IP6=I2C2
Mcu.IP7=MDMA
Mdma.MDMA_Channel2.Request0=SDMMC1_END_DATA
ProjectManager.CoupleFile=true
PCC.Seq0.Step0.Memory=ITCM/DTCM/Cache
PB3.Signal=DEBUG_JTDO-SWO
RCC.SYSCLKFreq_VALUE=280000000
RCC.I2C123Freq_Value=140000000
USB_DEVICE.MANUFACTURER_STRING-MSC_HS=SkyBean
PA12.Mode=Device_Only_FS
Dma.MEMTOMEM.0.Mode=DMA_NORMAL
Dma.MEMTOMEM.0.PeriphBurst=DMA_PBURST_SINGLE
KeepUserPlacement=false
USB_OTG_HS.VirtualMode=Device_Only_FS
PC5.GPIO_Label=DISP_TE
Dma.MEMTOMEM.0.MemInc=DMA_MINC_DISABLE
RCC.QSPICLockSelection=RCC_OSPICLKSOURCE_PLL2
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.SourceInc=MDMA_SRC_INC_BYTE
SH.GPXTI9.ConfNb=1
NVIC.EXTI9_5_IRQn=true\:5\:0\:true\:false\:true\:true\:true
PA14.Signal=DEBUG_JTCK-SWCLK
SH.S_TIM2_CH4.0=TIM2_CH4,PWM Generation4 CH4
PC6.GPIOParameters=PinState,GPIO_Label
PCC.Seq0.Step1.Frequency=64 MHz
Mdma.RequestSetsNb=1
Mdma.MDMA_Channel2.SDMMC1_END_DATA.0.TransferTriggerMode=MDMA_BUFFER_TRANSFER
PA9.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_RISING
RCC.DIVQ1Freq_Value=56000000
PCC.Seq0.Step1.Peripherals=
PE3.GPIO_Label=BT3
Dma.MEMTOMEM.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,FIFOThreshold,MemBurst,PeriphBurst,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
PC9.Signal=SDMMC1_D1
CORTEX_M7.CPU_DCache=Disabled
PCC.Seq0.Step0.Vdd=2.4
SDMMC1.IPParameters=ClockDiv,HardwareFlowControl,ClockPowerSave,ClockEdge
PC7.Mode=NorPsramChipSelect1_1
SH.FMC_D8_DA8.ConfNb=1
RCC.VCOInput2Freq_Value=8000000
RCC.APB1Freq_Value=140000000
VP_CRC_VS_CRC.Mode=CRC_Activate
Dma.UART4_RX.2.Polarity=HAL_DMAMUX_REQ_GEN_RISING
ProjectManager.DeviceId=STM32H7A3VITx
ProjectManager.LibraryCopy=1
PA3.GPIO_Label=DISP_BCKL
NVIC.UART7_IRQn=true\:2\:0\:true\:false\:true\:true\:true
isbadioc=false
